bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J16A.PIC
      <edc:SFRDef edc:_addr="0x42001CC4" edc:access="----------rrrrrr---rrrrr--rrrrrr" edc:cname="TXFQS" edc:impl="0x3F1F3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TFFL" edc:desc="Tx FIFO Free Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFGI" edc:desc="Tx FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TFQPI" edc:desc="Tx FIFO/Queue Put Index" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TFQF" edc:desc="Tx FIFO/Queue Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CC8" edc:access="-----------------------------nnn" edc:cname="TXESC" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TBDS" edc:desc="Tx Buffer Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TXBRP" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TRP0" edc:desc="Transmission Request Pending 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP1" edc:desc="Transmission Request Pending 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP2" edc:desc="Transmission Request Pending 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP3" edc:desc="Transmission Request Pending 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP4" edc:desc="Transmission Request Pending 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP5" edc:desc="Transmission Request Pending 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP6" edc:desc="Transmission Request Pending 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP7" edc:desc="Transmission Request Pending 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP8" edc:desc="Transmission Request Pending 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP9" edc:desc="Transmission Request Pending 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP10" edc:desc="Transmission Request Pending 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP11" edc:desc="Transmission Request Pending 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP12" edc:desc="Transmission Request Pending 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP13" edc:desc="Transmission Request Pending 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP14" edc:desc="Transmission Request Pending 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP15" edc:desc="Transmission Request Pending 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP16" edc:desc="Transmission Request Pending 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP17" edc:desc="Transmission Request Pending 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP18" edc:desc="Transmission Request Pending 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP19" edc:desc="Transmission Request Pending 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP20" edc:desc="Transmission Request Pending 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP21" edc:desc="Transmission Request Pending 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP22" edc:desc="Transmission Request Pending 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP23" edc:desc="Transmission Request Pending 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP24" edc:desc="Transmission Request Pending 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP25" edc:desc="Transmission Request Pending 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP26" edc:desc="Transmission Request Pending 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP27" edc:desc="Transmission Request Pending 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP28" edc:desc="Transmission Request Pending 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP29" edc:desc="Transmission Request Pending 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP30" edc:desc="Transmission Request Pending 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRP31" edc:desc="Transmission Request Pending 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CD0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="AR0" edc:desc="Add Request 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:desc="Add Request 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:desc="Add Request 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:desc="Add Request 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:desc="Add Request 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:desc="Add Request 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:desc="Add Request 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:desc="Add Request 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:desc="Add Request 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:desc="Add Request 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:desc="Add Request 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:desc="Add Request 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:desc="Add Request 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:desc="Add Request 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:desc="Add Request 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:desc="Add Request 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:desc="Add Request 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:desc="Add Request 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:desc="Add Request 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:desc="Add Request 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:desc="Add Request 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:desc="Add Request 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:desc="Add Request 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:desc="Add Request 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:desc="Add Request 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:desc="Add Request 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:desc="Add Request 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:desc="Add Request 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:desc="Add Request 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:desc="Add Request 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:desc="Add Request 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:desc="Add Request 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
