bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J16A.PIC
      <edc:SFRDef edc:_addr="0x42001CD4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBCR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CR0" edc:desc="Cancellation Request 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:desc="Cancellation Request 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:desc="Cancellation Request 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:desc="Cancellation Request 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:desc="Cancellation Request 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:desc="Cancellation Request 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:desc="Cancellation Request 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:desc="Cancellation Request 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:desc="Cancellation Request 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:desc="Cancellation Request 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:desc="Cancellation Request 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:desc="Cancellation Request 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:desc="Cancellation Request 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:desc="Cancellation Request 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:desc="Cancellation Request 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:desc="Cancellation Request 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:desc="Cancellation Request 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:desc="Cancellation Request 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:desc="Cancellation Request 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:desc="Cancellation Request 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:desc="Cancellation Request 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:desc="Cancellation Request 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:desc="Cancellation Request 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:desc="Cancellation Request 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:desc="Cancellation Request 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:desc="Cancellation Request 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:desc="Cancellation Request 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:desc="Cancellation Request 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:desc="Cancellation Request 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:desc="Cancellation Request 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:desc="Cancellation Request 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:desc="Cancellation Request 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TXBTO" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TO0" edc:desc="Transmission Occurred 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO1" edc:desc="Transmission Occurred 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO2" edc:desc="Transmission Occurred 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO3" edc:desc="Transmission Occurred 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO4" edc:desc="Transmission Occurred 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO5" edc:desc="Transmission Occurred 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO6" edc:desc="Transmission Occurred 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO7" edc:desc="Transmission Occurred 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO8" edc:desc="Transmission Occurred 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO9" edc:desc="Transmission Occurred 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO10" edc:desc="Transmission Occurred 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO11" edc:desc="Transmission Occurred 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO12" edc:desc="Transmission Occurred 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO13" edc:desc="Transmission Occurred 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO14" edc:desc="Transmission Occurred 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO15" edc:desc="Transmission Occurred 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO16" edc:desc="Transmission Occurred 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO17" edc:desc="Transmission Occurred 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO18" edc:desc="Transmission Occurred 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO19" edc:desc="Transmission Occurred 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO20" edc:desc="Transmission Occurred 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO21" edc:desc="Transmission Occurred 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO22" edc:desc="Transmission Occurred 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO23" edc:desc="Transmission Occurred 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO24" edc:desc="Transmission Occurred 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO25" edc:desc="Transmission Occurred 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO26" edc:desc="Transmission Occurred 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO27" edc:desc="Transmission Occurred 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO28" edc:desc="Transmission Occurred 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO29" edc:desc="Transmission Occurred 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO30" edc:desc="Transmission Occurred 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO31" edc:desc="Transmission Occurred 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TXBCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CF0" edc:desc="Tx Buffer Cancellation Finished 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF1" edc:desc="Tx Buffer Cancellation Finished 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF2" edc:desc="Tx Buffer Cancellation Finished 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF3" edc:desc="Tx Buffer Cancellation Finished 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF4" edc:desc="Tx Buffer Cancellation Finished 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF5" edc:desc="Tx Buffer Cancellation Finished 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF6" edc:desc="Tx Buffer Cancellation Finished 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF7" edc:desc="Tx Buffer Cancellation Finished 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF8" edc:desc="Tx Buffer Cancellation Finished 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF9" edc:desc="Tx Buffer Cancellation Finished 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF10" edc:desc="Tx Buffer Cancellation Finished 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF11" edc:desc="Tx Buffer Cancellation Finished 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF12" edc:desc="Tx Buffer Cancellation Finished 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF13" edc:desc="Tx Buffer Cancellation Finished 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF14" edc:desc="Tx Buffer Cancellation Finished 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF15" edc:desc="Tx Buffer Cancellation Finished 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF16" edc:desc="Tx Buffer Cancellation Finished 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF17" edc:desc="Tx Buffer Cancellation Finished 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF18" edc:desc="Tx Buffer Cancellation Finished 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF19" edc:desc="Tx Buffer Cancellation Finished 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF20" edc:desc="Tx Buffer Cancellation Finished 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF21" edc:desc="Tx Buffer Cancellation Finished 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF22" edc:desc="Tx Buffer Cancellation Finished 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF23" edc:desc="Tx Buffer Cancellation Finished 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF24" edc:desc="Tx Buffer Cancellation Finished 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF25" edc:desc="Tx Buffer Cancellation Finished 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF26" edc:desc="Tx Buffer Cancellation Finished 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF27" edc:desc="Tx Buffer Cancellation Finished 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF28" edc:desc="Tx Buffer Cancellation Finished 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF29" edc:desc="Tx Buffer Cancellation Finished 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF30" edc:desc="Tx Buffer Cancellation Finished 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF31" edc:desc="Tx Buffer Cancellation Finished 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CE0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBTIE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TIE0" edc:desc="Transmission Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE1" edc:desc="Transmission Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE2" edc:desc="Transmission Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE3" edc:desc="Transmission Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE4" edc:desc="Transmission Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE5" edc:desc="Transmission Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE6" edc:desc="Transmission Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE7" edc:desc="Transmission Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE8" edc:desc="Transmission Interrupt Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE9" edc:desc="Transmission Interrupt Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE10" edc:desc="Transmission Interrupt Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE11" edc:desc="Transmission Interrupt Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE12" edc:desc="Transmission Interrupt Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE13" edc:desc="Transmission Interrupt Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE14" edc:desc="Transmission Interrupt Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE15" edc:desc="Transmission Interrupt Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE16" edc:desc="Transmission Interrupt Enable 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE17" edc:desc="Transmission Interrupt Enable 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE18" edc:desc="Transmission Interrupt Enable 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE19" edc:desc="Transmission Interrupt Enable 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE20" edc:desc="Transmission Interrupt Enable 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE21" edc:desc="Transmission Interrupt Enable 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE22" edc:desc="Transmission Interrupt Enable 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE23" edc:desc="Transmission Interrupt Enable 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE24" edc:desc="Transmission Interrupt Enable 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE25" edc:desc="Transmission Interrupt Enable 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE26" edc:desc="Transmission Interrupt Enable 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE27" edc:desc="Transmission Interrupt Enable 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE28" edc:desc="Transmission Interrupt Enable 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE29" edc:desc="Transmission Interrupt Enable 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE30" edc:desc="Transmission Interrupt Enable 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIE31" edc:desc="Transmission Interrupt Enable 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
